#!/bin/bash

# ======================================================== #
# Скрипт удаления папок "HAZIR" и его вложенных файлов из  #
# папок в директории.                                      #
# -------------------------------------------------------- #
# Важно:                                                   #
# Сделайте скрипт исполняемым: (chmod +x script.sh)        #
# ======================================================== #


# Удаляем папку "HAZIR" и её содержимое в каждой подпапке
find . -type d -name "HAZIR" -exec rm -rfv {} \; -prune
